family_dict = {
    'Сидоров' :
        {
        ('Сидоров', 'Никита') : 35,
        ('Сидорова', 'Алина') : 34,
        ('Сидоров', 'Павел') : 10
    },
    'Петров':
        {
            ('Петров', 'Михаил'): 30,
            ('Петрова', 'Света'): 29,
            ('Петров', 'Александр'): 6,
            ('Петрова', 'Даша'): 4
        }
}

surname = input('Введите фамилию: ').title()

if family_dict.get(surname):
    for name, age in family_dict[surname].items():
        print(name[0], name[1], age)
else:
    print('Такой семьи нет в словаре')